# https://huggingface.co/spaces/evaluate-metric/bleu

import nltk
import evaluate
from nltk.translate.bleu_score import corpus_bleu
predictions = ["Коли я запитую Що ви думаєте коли думаєте про інвалідний візок? Вони відповідали Обмеження паніка жалість відсутність свободи","Я зрозумів що перебував під впливом цих упереджень і що я принципово бачив себе інакше", "Я відчув що частина мене вже не була собою", "Замість того щоб дивитися на себе з власної точки зору я піддавався впливу того як на мене дивилися інші люди", "Тому мені було так погано що я мусила прожити власну історію переосмислити і визначити себе Знайти себе Проживаючи власну історію ми навчилися серйозно ставитися до власної ідентичності"]
references = [
   ["Коли я запитала Що спадає вам на думку, коли ви чуєте про інвалідний візок? вони сказали обмеження паніка жалість обмеженість свободи" ],
    ["Я усвідомила  наскільки на мене вплинули ці стереотипи і змусили сприймати себе принципово інакше"],
    ["Я відчуваю що частина мене більше не є мною"],
    ["Я більше не дивлюся на себе з власної точки зору а радше на мене впливає те  як мене бачать інші Відчуваю що частково я не така  якою була раніше"],
    ["Через такий дискомфорт мені довелося вдатися до переосмислення та самовизначення Знайти себе живучи своєю власною історією"]
]
bleu = evaluate.load("bleu")
results = bleu.compute(predictions=predictions, references=references)
print(results)

# {'bleu': 0.1318539917430577, 'precisions': [0.4111111111111111, 0.16470588235294117, 0.0875, 0.05333333333333334], 'brevity_penalty': 0.9889503892939224, 'length_ratio': 0.989010989010989, 'translation_length': 90, 'reference_length': 91}