# https://huggingface.co/spaces/evaluate-metric/bleu

import nltk
import evaluate
from nltk.translate.bleu_score import corpus_bleu
predictions = ["Мистецтво здатне перевернути уявлення про себе змінити перспективу і стереотипи","Коли я почав пірнати в інвалідному візку в 2005 році я зрозумів що і акваланг і інвалідний візок дають однакову свободу під водою Можу сказати що враження від підводного плавання сповнені хвилювання і здивування і вони зовсім не схожі на враження від занурення в інвалідному візку", "Я подумав Цікаво що станеться коли ці дві речі поєднати? Зрештою у нас з'явився водолазний візок і протягом останніх семи років він возив мене у надзвичайні підводні подорожі", "Щоб ви могли зрозуміти про що я говорю я хотів би поділитися з вами одним із вражень які подарував мені цей скарб і яким чудовим є світ в який він мене переніс", "Це найкращий досвід який я мав у своєму житті і він не схожий ні на що що я коли-небудь мав раніше"]
references = [
   ["Мистецтво може трансформувати самосприйняття людини змінити і властиві їй погляди і стереотипи"],
    ["Коли я почала займатися підводним плаванням в інвалідному візку в 2005 році то виявила, що як з обладнанням для підводного плавання так і з візком під водою маєш однакову свободу Можна сказати що спорядження для підводного плавання справляє враження повне хвилювання та пригод відрізняється від враження яке справляють інвалідні візки І це враження від екіпірування для підводного плавання повне хвилювання та пригод повністю відрізняється від того яке справляють інвалідні візки"],
    ["Я подумала чи можна ці дві речі об’єднати? Зрештою ми справді зробили інвалідний візок для дайвінгу і за останні сім років я здійснила надзвичайні підводні подорожі"],
    ["Щоб ви зрозуміли про що саме я говорю то хочу поділитися з вами одним із досвідів які принесла мені ця чарівна зброя і яким чудовим є світ у який вона мене привела"],
    ["Це найпрекрасніший досвід який я коли-небудь мав у цьому житті"]
]
bleu = evaluate.load("bleu")
results = bleu.compute(predictions=predictions, references=references)
print(results)

# {'bleu': 0.1495145272475251, 'precisions': [0.4855072463768116, 0.24812030075187969, 0.109375, 0.056910569105691054], 'brevity_penalty': 0.9035270092600377, 'length_ratio': 0.9078947368421053, 'translation_length': 138, 'reference_length': 152}