# https://huggingface.co/spaces/evaluate-metric/bleu

import nltk
import evaluate
from nltk.translate.bleu_score import corpus_bleu
predictions = ["І скажімо звичайні люди бачать різницю в цінності та радості в силі та радості яку ми знаходимо коли не дивимося на пошкодження чи обмеження а дивимося на це з новим баченням з новою перспективою","Візок це трансформатор", "Я називаю цей візок трансформером тому що він дозволяє мені увійти в нове життя відкрити нову сторінку в моєму житті по-новому усвідомити себе", "Ніхто ніколи раніше не бачив інвалідного візка для пірнання тому поява такого візка символізує новий погляд на речі новий спосіб бачення речей і цей спосіб бачення речей закріплюється у свідомості кожного з вас", "Тож ви всі є частиною цієї роботи"]
references = [
   ["Тож погляньте на цю історію Звичайні люди можуть побачити різні цінності і відчути радість не зосереджуючись на недоліках чи обмеженнях а дивлячись на це з нових горизонтів і під новими кутами Тільки тоді ми знаходимо силу та щастя"],
    ["Інвалідний візок це трансформатор перевтілювач"],
    ["Зараз я називаю цей візок для підводного плавання трансформером тому що він дозволяє мені зробити крок у нове життя відкрити нову сторінку в житті та по-новому усвідомити себе"],
    ["Оскільки ніхто раніше не бачив нічого спільного між інвалідним візком і оснащення для пірнання під воду то запуск інвалідного візка для дайвінгу символізує новий спосіб бачення та нове розуміння Це нове бачення має сильний вплив на серце кожного"],
    ["Отже ви всі є частиною цієї праці"]
]
bleu = evaluate.load("bleu")
results = bleu.compute(predictions=predictions, references=references)
print(results)

# {'bleu': 0.19902179137323017, 'precisions': [0.53, 0.3157894736842105, 0.18888888888888888, 0.09411764705882353], 'brevity_penalty': 0.8521437889662112, 'length_ratio': 0.8620689655172413, 'translation_length': 100, 'reference_length': 116}