# https://huggingface.co/spaces/evaluate-metric/bleu

import nltk
import evaluate
from nltk.translate.bleu_score import corpus_bleu

predictions = ["Я радий бути тут, щоб поділитися з вами своєю подорожжю і розповісти про свободу, яку подарував мені інвалідний візок. ","Шістнадцять років тому я став прикутим до інвалідного візка,", "і серйозна хвороба заважала мені бачити світ так, як я звик.", "Коли я сів у візок, це дало мені новий вид свободи.",
 "Раніше я думав, що бути хворим і калікою - це погано на все життя.",
 "Але цей візок - як чарівна іграшка.","Він дозволяє мені гуляти з вітром.", "І це так приємно мати можливість вийти на вулицю!", "Я така щаслива, що знову вільна, але люди на вулиці ставляться до мене по-іншому.", "Вони ставляться до мене так, ніби я невидима, ніби я ношу плащ-невидимку.", "Вони дивляться на мене з упередженням, ніби я в інвалідному візку і я трохи безладний.",
 "Коли я запитую Що ви думаєте коли думаєте про інвалідний візок? Вони відповідали Обмеження паніка жалість відсутність свободи","Я зрозумів що перебував під впливом цих упереджень і що я принципово бачив себе інакше", "Я відчув що частина мене вже не була собою", "Замість того щоб дивитися на себе з власної точки зору я піддавався впливу того як на мене дивилися інші люди", "Тому мені було так погано що я мусила прожити власну історію переосмислити і визначити себе Знайти себе Проживаючи власну історію ми навчилися серйозно ставитися до власної ідентичності",
 "Ми навчилися серйозно ставитися до кожного слова нашого життя -- Девіс 2009, TEDx Women Я почала робити деякі роботи які мали на меті передати внутрішню радість і свободу перебування в інвалідному візку і я називаю його енергетичним кріслом тому що я можу взяти світ за роги","Я намагаюся передати те що я відчуваю всередині змінити те як я думав про себе коли вперше почав їздити на візку через позаконтекстну фотографію", "Візок став чимось на чому я можу писати і малювати", "Коли я почала залишати на собі слід щастя і свободи я була настільки схвильована що зовнішній світ відгукнувся на мої роботи", "Ці роботи здається відкривають нові горизонти і ведуть до трансформації мистецтва",
 "Мистецтво здатне перевернути уявлення про себе змінити перспективу і стереотипи","Коли я почав пірнати в інвалідному візку в 2005 році я зрозумів що і акваланг і інвалідний візок дають однакову свободу під водою Можу сказати що враження від підводного плавання сповнені хвилювання і здивування і вони зовсім не схожі на враження від занурення в інвалідному візку", "Я подумав Цікаво що станеться коли ці дві речі поєднати? Зрештою у нас з'явився водолазний візок і протягом останніх семи років він возив мене у надзвичайні підводні подорожі", "Щоб ви могли зрозуміти про що я говорю я хотів би поділитися з вами одним із вражень які подарував мені цей скарб і яким чудовим є світ в який він мене переніс", "Це найкращий досвід який я мав у своєму житті і він не схожий ні на що що я коли-небудь мав раніше",
 "Я можу практично вільно пересуватися на 360 градусів і відчувати найвищий рівень радості та свободи","І що зробило мене такою щасливою  такою чудовою  так це те що всі інші здавалося могли зрозуміти мене", "Їхні очі засяяли, і вони сказали: «Я хочу такий!». «Якщо ти можеш пірнати з аквалангом то немає нічого чого б я не зміг!", "Я думаю що саме момент коли вони бачать те чого ніколи раніше не бачили або те що виходить за межі їхньої уяви ламає їхнє сприйняття інвалідних візків і змушує їх поглянути на них знову", "Я також думаю що в той момент коли з'явилася ідея інвалідного візка для пірнання вона поширила відчуття свободи на інших",
 "І скажімо звичайні люди бачать різницю в цінності та радості в силі та радості яку ми знаходимо коли не дивимося на пошкодження чи обмеження а дивимося на це з новим баченням з новою перспективою","Візок це трансформатор", "Я називаю цей візок трансформером тому що він дозволяє мені увійти в нове життя відкрити нову сторінку в моєму житті по-новому усвідомити себе", "Ніхто ніколи раніше не бачив інвалідного візка для пірнання тому поява такого візка символізує новий погляд на речі новий спосіб бачення речей і цей спосіб бачення речей закріплюється у свідомості кожного з вас", "Тож ви всі є частиною цієї роботи"
]
references = [
   ["Я дуже рада мати змогу поділитися з вами своєю подорожжю та разом з тим розповісти про свободу, яку дав мені інвалідний візок."],
    ["Опинилася я в інвалідному візку шістнадцять років тому."],
    ["Серйозна хвороба забрала в мене можливість торкатися світу так, як раніше."],
    ["Однак з інвалідним візком для мене відкрилась абсолютно нова свобода."],
    ["Раніше я думала, що з обмеженими можливостями через хворобу друга половина мого життя вже точно не буде легкою."],
 
 ["Але ця коляска як чарівна іграшка,"], 
   ["бо з нею я можу вибиратися на свіже повітря."],
    ["Крім того, можливість вийти на вулицю це дуже класно!"],
    ["Хоча я й щаслива знову бути вільною, але ставлення до мене з боку інших тепер зовсім інше."],
    ["Здається, ніби я для них прозора, що, ніби одягнена у плащ-невидимку."],
    ["Вони дивляться косо на мене з упередженням, думаючи, що, якщо сиджу в інвалідному візку, то обов’язково обмежена у всьому."],

 ["Коли я запитала Що спадає вам на думку, коли ви чуєте про інвалідний візок? вони сказали обмеження паніка жалість обмеженість свободи" ],
    ["Я усвідомила  наскільки на мене вплинули ці стереотипи і змусили сприймати себе принципово інакше"],
    ["Я відчуваю що частина мене більше не є мною"],
    ["Я більше не дивлюся на себе з власної точки зору а радше на мене впливає те  як мене бачать інші Відчуваю що частково я не така  якою була раніше"],
    ["Через такий дискомфорт мені довелося вдатися до переосмислення та самовизначення Знайти себе живучи своєю власною історією"],

 ["Ми навчилися серйозно ставитися до кожного слова яке пишемо про своє життя ——Davis 2009, опубліковано в TEDx Women Я почала проводити різні заходи аби передати всім почуття внутрішньої радості і свободи які маєш перебуваючи в інвалідному візку Я називаю його кріслом сили тому що можу пересуватися в ньому по всьому по світу"],
    ["Я намагалася якнайкраще передати свої внутрішні відчуття через нестандартне зображення щоб змінити стереотип про себе коли я опинився в інвалідному візку"],
    ["Він дав мені змогу писати та малювати"],
    ["Коли я почала буквально залишати сліди свого внутрішнього щастя і свободи то і зовнішній світ відгукнувся на мої роботи І я була цьому безмежно рада"],
    ["Ці твори ніби відкрили мені нові горизонти й направили в бік мистецтва"],

 ["Мистецтво може трансформувати самосприйняття людини змінити і властиві їй погляди і стереотипи"],
    ["Коли я почала займатися підводним плаванням в інвалідному візку в 2005 році то виявила, що як з обладнанням для підводного плавання так і з візком під водою маєш однакову свободу Можна сказати що спорядження для підводного плавання справляє враження повне хвилювання та пригод відрізняється від враження яке справляють інвалідні візки І це враження від екіпірування для підводного плавання повне хвилювання та пригод повністю відрізняється від того яке справляють інвалідні візки"],
    ["Я подумала чи можна ці дві речі об’єднати? Зрештою ми справді зробили інвалідний візок для дайвінгу і за останні сім років я здійснила надзвичайні підводні подорожі"],
    ["Щоб ви зрозуміли про що саме я говорю то хочу поділитися з вами одним із досвідів які принесла мені ця чарівна зброя і яким чудовим є світ у який вона мене привела"],
    ["Це найпрекрасніший досвід який я коли-небудь мав у цьому житті"],

 ["Я можу практично вільно пересуватися без перешкод на 360 градусів і відчувати неперевершене щастя та свободу"],
    ["Що стосується мого здивування й захоплення то здається ніби інші також відчувають те саме"],
    ["Вони переглядались і казали Я хочу так само! Інші казали Якщо ти навіть вмієш займатися дайвінгом немає нічого чого б я не зміг!"],
    ["Я думаю що в той момент вони бачили щось чого ніколи раніше не бачили або що було за межами їх уяви і це зруйнувало їх уявлення про інвалідні візки змушувало поглянути на них новими очима"],
    ["Я також відчуваю що в той момент коли виникла ідея інвалідного візка для дайвінгу то це відчуття свободи заразило інших людей"],

 ["Тож погляньте на цю історію Звичайні люди можуть побачити різні цінності і відчути радість не зосереджуючись на недоліках чи обмеженнях а дивлячись на це з нових горизонтів і під новими кутами Тільки тоді ми знаходимо силу та щастя"],
    ["Інвалідний візок це трансформатор перевтілювач"],
    ["Зараз я називаю цей візок для підводного плавання трансформером тому що він дозволяє мені зробити крок у нове життя відкрити нову сторінку в житті та по-новому усвідомити себе"],
    ["Оскільки ніхто раніше не бачив нічого спільного між інвалідним візком і оснащення для пірнання під воду то запуск інвалідного візка для дайвінгу символізує новий спосіб бачення та нове розуміння Це нове бачення має сильний вплив на серце кожного"],
    ["Отже ви всі є частиною цієї праці"]

]
bleu = evaluate.load("bleu")
results = bleu.compute(predictions=predictions, references=references)
print(results)

# {'bleu': 0.18461040582339483, 'precisions': [0.4794326241134752, 0.2556053811659193, 0.14691943127962084, 0.08375209380234507], 'brevity_penalty': 0.9368348868457684, 'length_ratio': 0.9387483355525965, 'translation_length': 705, 'reference_length': 751}