# https://huggingface.co/spaces/evaluate-metric/bleu

import nltk
import evaluate
from nltk.translate.bleu_score import corpus_bleu
predictions = ["Я радий бути тут, щоб поділитися з вами своєю подорожжю і розповісти про свободу, яку подарував мені інвалідний візок. ","Шістнадцять років тому я став прикутим до інвалідного візка,", "і серйозна хвороба заважала мені бачити світ так, як я звик.", "Коли я сів у візок, це дало мені новий вид свободи.", "Раніше я думав, що бути хворим і калікою - це погано на все життя."]
references = [
   ["Я дуже рада мати змогу поділитися з вами своєю подорожжю та разом з тим розповісти про свободу, яку дав мені інвалідний візок."],
    ["Опинилася я в інвалідному візку шістнадцять років тому."],
    ["Серйозна хвороба забрала в мене можливість торкатися світу так, як раніше."],
    ["Однак з інвалідним візком для мене відкрилась абсолютно нова свобода."],
    ["Раніше я думала, що з обмеженими можливостями через хворобу друга половина мого життя вже точно не буде легкою."]
]
bleu = evaluate.load("bleu")
results = bleu.compute(predictions=predictions, references=references)
print(results)

# {'bleu': 0.1756825820356824, 'precisions': [0.40540540540540543, 0.2318840579710145, 0.140625, 0.0847457627118644], 'brevity_penalty': 0.9602702338479381, 'length_ratio': 0.961038961038961, 'translation_length': 74, 'reference_length': 77}