# https://huggingface.co/spaces/evaluate-metric/bleu

import nltk
import evaluate
from nltk.translate.bleu_score import corpus_bleu
predictions = ["Я можу практично вільно пересуватися на 360 градусів і відчувати найвищий рівень радості та свободи","І що зробило мене такою щасливою  такою чудовою  так це те що всі інші здавалося могли зрозуміти мене", "Їхні очі засяяли, і вони сказали: «Я хочу такий!». «Якщо ти можеш пірнати з аквалангом то немає нічого чого б я не зміг!", "Я думаю що саме момент коли вони бачать те чого ніколи раніше не бачили або те що виходить за межі їхньої уяви ламає їхнє сприйняття інвалідних візків і змушує їх поглянути на них знову", "Я також думаю що в той момент коли з'явилася ідея інвалідного візка для пірнання вона поширила відчуття свободи на інших"]
references = [
   ["Я можу практично вільно пересуватися без перешкод на 360 градусів і відчувати неперевершене щастя та свободу"],
    ["Що стосується мого здивування й захоплення то здається ніби інші також відчувають те саме"],
    ["Вони переглядались і казали Я хочу так само! Інші казали Якщо ти навіть вмієш займатися дайвінгом немає нічого чого б я не зміг!"],
    ["Я думаю що в той момент вони бачили щось чого ніколи раніше не бачили або що було за межами їх уяви і це зруйнувало їх уявлення про інвалідні візки змушувало поглянути на них новими очима"],
    ["Я також відчуваю що в той момент коли виникла ідея інвалідного візка для дайвінгу то це відчуття свободи заразило інших людей"]
]
bleu = evaluate.load("bleu")
results = bleu.compute(predictions=predictions, references=references)
print(results)

# {'bleu': 0.26308022545098686, 'precisions': [0.5, 0.2972972972972973, 0.2169811320754717, 0.1485148514851485], 'brevity_penalty': 1.0, 'length_ratio': 1.045045045045045, 'translation_length': 116, 'reference_length': 111}